[
    {
        "missionId": "M-001",
        "missionName": "Operation Desert Veil",
        "color": "yellow",
        "backstory": "A covert intelligence breach has compromised diplomatic trade channels in a Southland desert state. A rogue network embedded within the capital technology sector is manipulating resource contracts tied to rare mineral exports. An elite team must infiltrate the operation and expose its leadership without disrupting regional trade balance.",
        "regions": [
            "Southland",
            "Midlands"
        ],
        "countries": [
            {
                "id": "zahara",
                "name": "Zahara",
                "language": "Zahari",
                "color": "#E69A4C"
            }
        ],
        "requiredRoles": [
            "Infiltration",
            "Recon",
            "Communications",
            "Tech Support"
        ]
    },
    {
        "missionId": "M-002",
        "missionName": "Operation Jade Circuit",
        "color": "green",
        "backstory": "A cybercrime syndicate operating along Midland trade corridors has hijacked an encrypted satellite relay used for mineral logistics coordination. Intelligence suggests Northland manufacturing data is being rerouted to black market buyers. The team must secure the uplink, recover encrypted schematics, and extract before detection.",
        "regions": [
            "Midlands",
            "Northland"
        ],
        "countries": [
            {
                "id": "thyrel",
                "name": "Thyrel",
                "language": "Thyrelic",
                "color": "#4A9B68"
            }
        ],
        "requiredRoles": [
            "Tech Support",
            "Surveillance",
            "Extraction",
            "Negotiation"
        ]
    },
    {
        "missionId": "M-003",
        "missionName": "Operation Northern Echo",
        "color": "orange",
        "backstory": "A weapons smuggling network based in Southland has expanded into a disciplined paramilitary force supplying illegal arms to fringe factions. Intelligence indicates covert buyers within Northland border territories. The mission objective is to intercept trade data and dismantle command leadership without triggering open conflict.",
        "regions": [
            "Southland",
            "Northland"
        ],
        "countries": [
            {
                "id": "calvor",
                "name": "Calvor",
                "language": "Calvorian",
                "color": "#E8642B"
            }
        ],
        "requiredRoles": [
            "Recon",
            "Infiltration",
            "Negotiation",
            "Extraction"
        ]
    },
    {
        "missionId": "M-004",
        "missionName": "Operation Jungle Call",
        "color": "darkGreen",
        "backstory": "A multinational data consortium operating from dense southern jungles is suspected of laundering intelligence through agricultural export systems. Multiple remote facilities process both biological research data and trade logistics. The operation requires synchronized digital breach and ground infiltration across hostile terrain.",
        "regions": [
            "Southland"
        ],
        "countries": [
            {
                "id": "velthar",
                "name": "Velthar",
                "language": "Velthari",
                "color": "#F2B86E"
            }
        ],
        "requiredRoles": [
            "Tech Support",
            "Communications",
            "Surveillance",
            "Infiltration"
        ]
    },
    {
        "missionId": "M-005",
        "missionName": "Operation Crimson Veins",
        "color": "darkRed",
        "backstory": "A cartel spanning multiple Southland states is exploiting medical supply routes to smuggle advanced bio reactive components. These materials are traced back to jungle research zones and Midland distribution hubs. The team must disrupt logistics, identify the source network, and exit without exposing regional partners.",
        "regions": [
            "Southland",
            "Midlands"
        ],
        "countries": [
            {
                "id": "nashara",
                "name": "Nashara",
                "language": "Nashari",
                "color": "#F08949"
            }
        ],
        "requiredRoles": [
            "Recon",
            "Negotiation",
            "Infiltration",
            "Extraction"
        ]
    }
]